Assignment_1/FIO/q7/output_q7.txt
fastest_1g_read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process

fastest_1g_read: (groupid=0, jobs=1): err= 0: pid=306719: Fri Apr 11 17:36:26 2025
  read: IOPS=1943, BW=1943MiB/s (2037MB/s)(1024MiB/527msec)
    clat (usec): min=376, max=9577, avg=512.56, stdev=291.94
     lat (usec): min=376, max=9578, avg=512.72, stdev=291.97
    clat percentiles (usec):
     |  1.00th=[  396],  5.00th=[  424], 10.00th=[  437], 20.00th=[  453],
     | 30.00th=[  465], 40.00th=[  482], 50.00th=[  494], 60.00th=[  510],
     | 70.00th=[  523], 80.00th=[  537], 90.00th=[  578], 95.00th=[  619],
     | 99.00th=[  750], 99.50th=[  906], 99.90th=[ 1074], 99.95th=[ 9634],
     | 99.99th=[ 9634]
   bw (  MiB/s): min= 1946, max= 1946, per=100.00%, avg=1946.00, stdev= 0.00, samples=1
   iops        : min= 1946, max= 1946, avg=1946.00, stdev= 0.00, samples=1
  lat (usec)   : 500=54.00%, 750=44.92%, 1000=0.78%
  lat (msec)   : 2=0.20%, 10=0.10%
  cpu          : usr=0.57%, sys=39.35%, ctx=1024, majf=0, minf=268
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1943MiB/s (2037MB/s), 1943MiB/s-1943MiB/s (2037MB/s-2037MB/s), io=1024MiB (1074MB), run=527-527msec

Disk stats (read/write):
  nvme0n1: ios=6236/42, merge=0/0, ticks=1269/2, in_queue=1271, util=60.16%